[{"id":160788420,"title":"Self study VS studying at a reputed institute - Which is more effective to get into the NEET?\r","author":"Dev Web\r","date":"December 14, 2020\r","content":"\r\n_If you are dedicated and confident enough for self study ..then a big YES !!_\r\n\r\n### If you move forward by self-studying\r\n\r\n<b>Biology</b> is 80% from NCERT only…You can attempt 75–80 question just by doing NCERT properly.\r\n\r\nPhysics….for physics i will suggest to to take a person tutor…because there are few things which you really can’t study without proper support of a experienced tutor. Read Pradeep thoroughly as it is the best book i ever seen for theory….NCERT theory is really very good… For question solving have DC pandey\r\n\r\nChemistry - For inorganic chemistry just follow NCERT only…i am 100% sure that you will not loose even a single mark. For physical again i will suggest you to take a tutor or you can purchase plancess video lectures for chemistry. For organic do NCERT and some reference book(Best is mtg)\r\n\r\nWith proper study, one can score 540+ by self studying.\r\n\r\nBUT\r\n\r\nNow imagine yourself sitting in a room, studying alone. Though you are concentrating but you don’t know the amount of competition you’ll have to face in the real EXAM.During the whole year you won’t be able to FACE the competition which exists around you. Above all , home is a place of distractions. You know siblings , neighbors , noises etc. Concentration needs PEACE.\r\n\r\nYou’ll have mock tests , surprise tests etc in coaching institute. Tutors will tell you a number of tips and tricks when you are a student of a coaching . The tutors have knowledge about each and every chapter. You’ll see that many students are ahead of you in scoring marks in tests. They’ll tell you what is important and what is not that important. There are score cards , rank cards , everything. Their experience will add up to your marks.\r\n\r\nWHAT TO DO!!\r\n\r\n   <ul> <li>If you are too sure, confident and dedicated - only then move forward with self study.</li>\r\n    <li>If you wish to aim high, go for coaching.</li>\r\n    <li>If you live far away from a coaching institute, buy DLP</li></ul>\r\n\r\nFor Best Possible Results !!\r\n\r\nEnrol with a Reputed Institute with excellent teachers, and then you have to make your best of Self Study at home coupled with lots of daily practice of homework problems.\r\n\r\nStudents who are very highly self motivated and self disciplined, coupled with parental guidance, support and monitoring are able to clear NEET with self studies alone, but in my opinion it takes a right mix of coaching and a lot of study at home that make the path a lot easier for a lot of students\r\n"},{"id":157703940,"title":"PHYSICS KE NUMERICALS NAHI HOTE KYA KARU!!! HERE'S THE SOLUTION\r","author":"Dewasis\r","date":"December 23, 2019\r","content":"\r\nThe problem with subjects PCB is, if you are scared from anyone of those, that subject won't leave an inch to haunt and remind you periodically about your weakness. And for majority of the NEET aspirants, Physics is that subject.\r\n\r\n_Running away isn't a solution. We need to tackle it._\r\n\r\n### Following are key points which will help you to rectify your problems in physics and solve the numericals efficiently\r\n\r\n  <ul>  \r\n    <li>\r\n    Try and understand what the concept is all about. You should know HOW AND WHY that particular concept is true.\r\n    </li>\r\n    <li>\r\n    Whenever you read a question, write what data is given what you have to find out WITH UNITS.\r\n    </li>\r\n    <li>\r\n    Before solving numericals of a new concept, try to look and understand at least 5-10 numericals of that concept. This will help you getting an idea to approach questions.\r\n    </li>\r\n    <li>\r\n    Have proper concentration while solving to avoid calculation error.\r\n    </li>\r\n    <li>\r\n    Draw diagrams for the questions where required because for a physics student DIAGRAM IS HIS/HER LANGUAGE OF COMMUNICATION.\r\n    </li>\r\n    <li>\r\n    Always start with the easiest questions. No need to start with hard ones. As you gain confidence by solving the easy ones, gradually increase the toughness level.\r\n    </li>\r\n    <li>\r\n    Solve 50-100 questions of each chapter to gain confidence.\r\n    </li>\r\n    <li>\r\n    Your no. of Qs to solve should be directly proportional to importance of that topic.\r\n    </li>\r\n    <li>\r\n    Don't get frustrated. Have patience and never be tired of learning.\r\n    </li>\r\n    <li>\r\n    Believe in yourself.\r\n    </li> \r\n    </ul>\r\n\r\n_Pro Tip_ - The more you try to solve a numerical in correct different ways or you try to solve a numerical after getting stuck in it, the better you are leaning. So, don't lose hope and always try. Half of the problem is solved here.\r\n\r\nAll the best Aspirants\r\n😄😄😄\r\n"}]